<details><summary>Digger run report at 2023-10-13 12:06:37 (UTC)</summary>
                    <details><summary>Plan for <b>rimvydascivilis/alpha-infra#live_staging_data</b></summary>
  
```terraform
Initializing the backend...

Initializing provider plugins...
- Reusing previous version of hashicorp/aws from the dependency lock file
- Using previously-installed hashicorp/aws v5.21.0

Terraform has been successfully initialized!
data.aws_availability_zones.available: Reading...
data.aws_availability_zones.available: Read complete after 0s [id=us-east-1]

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.

  ```
</details>

<details><summary>Terraform plan validation check (live_staging_data)</summary>
  Terraform plan validation checks succeeded :white_check_mark:
</details>


<details><summary>Plan for <b>rimvydascivilis/alpha-infra#live_staging_ecr</b></summary>
  
```terraform
Terraform will perform the following actions:

  # aws_ecr_lifecycle_policy.this[0] will be created
  + resource "aws_ecr_lifecycle_policy" "this" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Keep last 15 images"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber   = 15
                          + countType     = "imageCountMoreThan"
                          + tagPrefixList = [
                              + "v",
                            ]
                          + tagStatus     = "tagged"
                        }
                    },
                ]
            }
        )
      + registry_id = (known after apply)
      + repository  = "app-staging"
    }

  # aws_ecr_repository.this[0] will be created
  + resource "aws_ecr_repository" "this" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "IMMUTABLE"
      + name                 = "app-staging"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags                 = {
          + "Environment" = "staging"
          + "Terraform"   = "true"
        }
      + tags_all             = {
          + "Environment" = "staging"
          + "Terraform"   = "true"
        }

      + encryption_configuration {
          + encryption_type = "AES256"
          + kms_key         = (known after apply)
        }

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # aws_ecr_repository_policy.this[0] will be created
  + resource "aws_ecr_repository_policy" "this" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "ecr:ListTagsForResource",
                          + "ecr:ListImages",
                          + "ecr:GetRepositoryPolicy",
                          + "ecr:GetLifecyclePolicyPreview",
                          + "ecr:GetLifecyclePolicy",
                          + "ecr:GetDownloadUrlForLayer",
                          + "ecr:GetAuthorizationToken",
                          + "ecr:DescribeRepositories",
                          + "ecr:DescribeImages",
                          + "ecr:DescribeImageScanFindings",
                          + "ecr:BatchGetImage",
                          + "ecr:BatchCheckLayerAvailability",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::039454511521:root"
                        }
                      + Sid       = "PrivateReadOnly"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + registry_id = (known after apply)
      + repository  = "app-staging"
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + repository_arn         = (known after apply)
  + repository_registry_id = (known after apply)
  + repository_url         = (known after apply)

  ```
</details>


<details><summary>Terraform plan validation check (live_staging_ecr)</summary>
  Terraform plan validation checks succeeded :white_check_mark:
</details>


<details><summary>Plan for <b>rimvydascivilis/alpha-infra#live_staging_eks</b></summary>
  
```terraform
aws_security_group.node[0]: Refreshing state... [id=sg-073f0eb34900457c7]
data.aws_caller_identity.current: Reading...
aws_security_group.cluster[0]: Refreshing state... [id=sg-044f16c76d3782fcb]
module.eks_managed_node_group["general"].data.aws_caller_identity.current: Reading...
data.aws_partition.current: Reading...
module.kms.data.aws_caller_identity.current: Reading...
module.eks_managed_node_group["general"].data.aws_partition.current: Reading...
module.kms.data.aws_partition.current: Reading...
module.kms.data.aws_partition.current: Read complete after 0s [id=aws]
aws_cloudwatch_log_group.this[0]: Refreshing state... [id=/aws/eks/eks-staging/cluster]
module.eks_managed_node_group["general"].data.aws_partition.current: Read complete after 0s [id=aws]
data.aws_partition.current: Read complete after 0s [id=aws]
module.eks_managed_node_group["general"].data.aws_iam_policy_document.assume_role_policy[0]: Reading...
data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.eks_managed_node_group["general"].data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2560088296]
data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2764486067]
module.eks_managed_node_group["general"].aws_iam_role.this[0]: Refreshing state... [id=general-eks-node-group-20231013114406218900000003]
aws_iam_role.this[0]: Refreshing state... [id=eks-staging-cluster-20231013114406216600000001]
module.kms.data.aws_caller_identity.current: Read complete after 0s [id=039454511521]
data.aws_caller_identity.current: Read complete after 0s [id=039454511521]
module.eks_managed_node_group["general"].data.aws_caller_identity.current: Read complete after 0s [id=039454511521]
data.aws_iam_session_context.current: Reading...
data.aws_iam_session_context.current: Read complete after 0s [id=arn:aws:iam::039454511521:user/rimvydas]
module.eks_managed_node_group["general"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"]: Refreshing state... [id=general-eks-node-group-20231013114406218900000003-20231013114407847600000005]
module.eks_managed_node_group["general"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"]: Refreshing state... [id=general-eks-node-group-20231013114406218900000003-20231013114408081400000007]
module.eks_managed_node_group["general"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"]: Refreshing state... [id=general-eks-node-group-20231013114406218900000003-20231013114408036800000006]
aws_iam_role_policy_attachment.this["AmazonEKSClusterPolicy"]: Refreshing state... [id=eks-staging-cluster-20231013114406216600000001-20231013114408446300000008]
aws_iam_role_policy_attachment.this["AmazonEKSVPCResourceController"]: Refreshing state... [id=eks-staging-cluster-20231013114406216600000001-20231013114408448900000009]
module.kms.data.aws_iam_policy_document.this[0]: Reading...
module.kms.data.aws_iam_policy_document.this[0]: Read complete after 0s [id=3908358093]
module.kms.aws_kms_key.this[0]: Refreshing state... [id=cb43c7ab-6fba-48c1-8412-8704afe15168]
aws_security_group_rule.node["ingress_cluster_kubelet"]: Refreshing state... [id=sgrule-4270708759]
aws_security_group_rule.node["ingress_cluster_443"]: Refreshing state... [id=sgrule-2896772303]
aws_security_group_rule.node["ingress_self_coredns_udp"]: Refreshing state... [id=sgrule-2634311641]
aws_security_group_rule.node["ingress_self_coredns_tcp"]: Refreshing state... [id=sgrule-962315318]
aws_security_group_rule.node["ingress_cluster_4443_webhook"]: Refreshing state... [id=sgrule-3874049725]
aws_security_group_rule.node["ingress_cluster_6443_webhook"]: Refreshing state... [id=sgrule-799746347]
aws_security_group_rule.node["ingress_nodes_ephemeral"]: Refreshing state... [id=sgrule-1609955449]
aws_security_group_rule.node["ingress_cluster_9443_webhook"]: Refreshing state... [id=sgrule-1482041025]
aws_security_group_rule.node["ingress_cluster_8443_webhook"]: Refreshing state... [id=sgrule-1022825738]
aws_security_group_rule.node["egress_all"]: Refreshing state... [id=sgrule-2472210277]
aws_security_group_rule.cluster["ingress_nodes_443"]: Refreshing state... [id=sgrule-3447937206]
aws_iam_policy.cluster_encryption[0]: Refreshing state... [id=arn:aws:iam::039454511521:policy/eks-staging-cluster-ClusterEncryption2023101311443417330000000a]
module.kms.aws_kms_alias.this["cluster"]: Refreshing state... [id=alias/eks/eks-staging]
aws_iam_role_policy_attachment.cluster_encryption[0]: Refreshing state... [id=eks-staging-cluster-20231013114406216600000001-2023101311443478930000000b]
aws_eks_cluster.this[0]: Refreshing state... [id=eks-staging]
time_sleep.this[0]: Refreshing state... [id=2023-10-13T11:53:53Z]
data.aws_eks_addon_version.this["vpc-cni"]: Reading...
data.aws_eks_addon_version.this["coredns"]: Reading...
data.aws_eks_addon_version.this["kube-proxy"]: Reading...
aws_ec2_tag.cluster_primary_security_group["Environment"]: Refreshing state... [id=sg-0fc60012693b497ae,Environment]
data.tls_certificate.this[0]: Reading...
aws_ec2_tag.cluster_primary_security_group["Terraform"]: Refreshing state... [id=sg-0fc60012693b497ae,Terraform]
module.eks_managed_node_group["general"].aws_launch_template.this[0]: Refreshing state... [id=lt-08c198930bd9c71ac]
data.tls_certificate.this[0]: Read complete after 0s [id=5933588ce34e24e9fb40c3565fb0b5993639df67]
aws_iam_openid_connect_provider.oidc_provider[0]: Refreshing state... [id=arn:aws:iam::039454511521:oidc-provider/oidc.eks.us-east-1.amazonaws.com/id/59BD58F5B14FC713383F24F9B0EE3A63]
module.eks_managed_node_group["general"].aws_eks_node_group.this[0]: Refreshing state... [id=eks-staging:general-2023101311535584640000000e]
data.aws_eks_addon_version.this["vpc-cni"]: Read complete after 0s [id=vpc-cni]
data.aws_eks_addon_version.this["coredns"]: Read complete after 0s [id=coredns]
data.aws_eks_addon_version.this["kube-proxy"]: Read complete after 0s [id=kube-proxy]
aws_eks_addon.this["coredns"]: Refreshing state... [id=eks-staging:coredns]
aws_eks_addon.this["kube-proxy"]: Refreshing state... [id=eks-staging:kube-proxy]
aws_eks_addon.this["vpc-cni"]: Refreshing state... [id=eks-staging:vpc-cni]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.eks_managed_node_group["general"].aws_eks_node_group.this[0] has changed
  ~ resource "aws_eks_node_group" "this" {
        id                     = "eks-staging:general-2023101311535584640000000e"
      + labels                 = {}
        tags                   = {
            "Environment" = "staging"
            "Name"        = "general"
            "Terraform"   = "true"
        }
        # (15 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────
  ```
</details>


<details><summary>Terraform plan validation check (live_staging_eks)</summary>
  Terraform plan validation checks succeeded :white_check_mark:
</details>


<details><summary>Plan for <b>rimvydascivilis/alpha-infra#live_staging_k8s-addons</b></summary>
  
```terraform
Initializing the backend...

Initializing provider plugins...
- Reusing previous version of hashicorp/helm from the dependency lock file
- Reusing previous version of hashicorp/kubernetes from the dependency lock file
- Reusing previous version of hashicorp/aws from the dependency lock file
- Using previously-installed hashicorp/helm v2.11.0
- Using previously-installed hashicorp/kubernetes v2.23.0
- Using previously-installed hashicorp/aws v5.21.0

Terraform has been successfully initialized!
aws_iam_policy.aws_load_balancer_controller[0]: Refreshing state... [id=arn:aws:iam::039454511521:policy/eks-staging-load-balancer-controller]
data.aws_eks_cluster.eks: Reading...
data.aws_iam_openid_connect_provider.this: Reading...
aws_iam_policy.cluster_autoscaler[0]: Refreshing state... [id=arn:aws:iam::039454511521:policy/eks-staging-cluster-autoscaler]
data.aws_eks_cluster_auth.eks: Reading...
data.aws_eks_cluster_auth.eks: Read complete after 0s [id=eks-staging]
data.aws_iam_openid_connect_provider.this: Read complete after 0s [id=arn:aws:iam::039454511521:oidc-provider/oidc.eks.us-east-1.amazonaws.com/id/59BD58F5B14FC713383F24F9B0EE3A63]
data.aws_iam_policy_document.aws_load_balancer_controller: Reading...
data.aws_iam_policy_document.cluster_autoscaler: Reading...
data.aws_iam_policy_document.aws_load_balancer_controller: Read complete after 0s [id=1825627564]
data.aws_iam_policy_document.cluster_autoscaler: Read complete after 0s [id=3939307914]
aws_iam_role.cluster_autoscaler[0]: Refreshing state... [id=eks-staging-cluster-autoscaler]
aws_iam_role.aws_load_balancer_controller[0]: Refreshing state... [id=eks-staging-load-balancer-controller]
data.aws_eks_cluster.eks: Read complete after 0s [id=eks-staging]
aws_iam_role_policy_attachment.aws_load_balancer_controller[0]: Refreshing state... [id=eks-staging-load-balancer-controller-20231013115723662900000002]
aws_iam_role_policy_attachment.cluster_autoscaler[0]: Refreshing state... [id=eks-staging-cluster-autoscaler-20231013115723658100000001]
helm_release.cluster_autoscaler[0]: Refreshing state... [id=autoscaler]
helm_release.aws_load_balancer_controller[0]: Refreshing state... [id=aws-load-balancer-controller]
helm_release.argocd[0]: Refreshing state... [id=argocd]

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.

  ```
</details>


<details><summary>Terraform plan validation check (live_staging_k8s-addons)</summary>
  Terraform plan validation checks succeeded :white_check_mark:
</details>


<details><summary>Plan for <b>rimvydascivilis/alpha-infra#live_staging_vpc</b></summary>
  
```terraform
Initializing the backend...

Initializing provider plugins...
- Reusing previous version of hashicorp/aws from the dependency lock file
- Using previously-installed hashicorp/aws v5.21.0

Terraform has been successfully initialized!
aws_vpc.this[0]: Refreshing state... [id=vpc-02787dd14380096d0]
aws_subnet.private[1]: Refreshing state... [id=subnet-019be35d8bb9cfa73]
aws_default_route_table.default[0]: Refreshing state... [id=rtb-00b1dd80bb5f5a5ca]
aws_subnet.private[2]: Refreshing state... [id=subnet-0a2dce1751ff6adcd]
aws_default_security_group.this[0]: Refreshing state... [id=sg-0d335e5c6101a1d46]
aws_subnet.private[0]: Refreshing state... [id=subnet-078ed00d5361747db]
aws_default_network_acl.this[0]: Refreshing state... [id=acl-070d2ab5d4586d980]
aws_internet_gateway.this[0]: Refreshing state... [id=igw-03ceaa93f1356815d]
aws_route_table.private[0]: Refreshing state... [id=rtb-00b94f529aad8fc24]
aws_subnet.intra[2]: Refreshing state... [id=subnet-07d9ea370bfe74644]
aws_subnet.public[0]: Refreshing state... [id=subnet-0222aa8bb754c5d31]
aws_subnet.public[1]: Refreshing state... [id=subnet-04578f066f122de24]
aws_subnet.public[2]: Refreshing state... [id=subnet-0213a1e92056659a1]
aws_subnet.intra[0]: Refreshing state... [id=subnet-06411f0fbac7b713f]
aws_subnet.intra[1]: Refreshing state... [id=subnet-0d4d0ff0f2e0236fa]
aws_route_table.intra[0]: Refreshing state... [id=rtb-00210cf139ab8b816]
aws_eip.nat[0]: Refreshing state... [id=eipalloc-0d3132a2de77af2af]
aws_route_table.public[0]: Refreshing state... [id=rtb-092cdfa16c80090e1]
aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-0a6c89ffe3a60bdc2]
aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-05dd5a9ff23d3fee9]
aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0b920c5d7742f7d88]
aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-01cdcc5a85e1dea2d]
aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-03b23a2ca33be8327]
aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-092cdfa16c80090e11080289494]
aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-02c9dc912e6541dd2]
aws_route_table_association.intra[2]: Refreshing state... [id=rtbassoc-0701feee500308be2]
aws_route_table_association.intra[0]: Refreshing state... [id=rtbassoc-028b6724f2ff0705c]
aws_route_table_association.intra[1]: Refreshing state... [id=rtbassoc-0a0d0e60852621b48]
aws_nat_gateway.this[0]: Refreshing state... [id=nat-01b2ddee7d8b40032]
aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-00b94f529aad8fc241080289494]

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.

  ```
</details>


<details><summary>Terraform plan validation check (live_staging_vpc)</summary>
  Terraform plan validation checks succeeded :white_check_mark:
</details>

</details>